# Analise dos Dados de Venda

In [2]:
# Importando o pandas
import pandas as pd

## Importando os Dados

In [3]:
df = pd.read_excel('Report-consolidado.xlsx')

In [4]:
#Vizualização das primeiras linhas do Data Frame
df.head()

,Segmento,País,Produto,Qtde de Unidades Vendidas,Preço Unitário,Valor Total,Desconto,Valor Total c/ Desconto,Custo Total,Lucro,Data,Mês,Ano
0,Governo,Alemanha,Produto 1,1321.0,20,26420.0,0.0,26420.0,14531.0,11889.0,01/01/2019,Janeiro,2019
1,Governo,Alemanha,Produto 1,1513.0,350,529550.0,0.0,529550.0,432718.0,96832.0,01/12/2019,Dezembro,2019
2,Governo,Alemanha,Produto 2,2146.0,7,15022.0,0.0,15022.0,10730.0,4292.0,01/09/2019,Setembro,2019
3,Governo,Alemanha,Produto 3,1006.0,350,352100.0,0.0,352100.0,261560.0,90540.0,01/06/2019,Junho,2019
4,Governo,Alemanha,Produto 3,1513.0,350,529550.0,0.0,529550.0,393380.0,136170.0,01/12/2019,Dezembro,2019

## Verificando tipo de Dado

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 700 entries, 0 to 699
Data columns (total 13 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Segmento                   700 non-null    object
 1   País                       700 non-null    object
 2   Produto                    700 non-null    object
 3   Qtde de Unidades Vendidas  700 non-null    float64
 4   Preço Unitário             700 non-null    int64
 5   Valor Total                700 non-null    float64
 6   Desconto                   700 non-null    float64
 7   Valor Total c/ Desconto    700 non-null    float64
 8   Custo Total                700 non-null    float64
 9   Lucro                      700 non-null    float64
 10  Data                       700 non-null    object
 11  Mês                        700 non-null    object
 12  Ano                        700 non-null    int64
dtypes: float64(6), int64(2), object(5)
memory usage: 71.2+ KB

## Verificando quantidade de linhas

In [6]:
df.shape[0]

700

## Alterando o nome das Colunas no Data Frame

In [7]:
df.head()

,Segmento,País,Produto,Qtde de Unidades Vendidas,Preço Unitário,Valor Total,Desconto,Valor Total c/ Desconto,Custo Total,Lucro,Data,Mês,Ano
0,Governo,Alemanha,Produto 1,1321.0,20,26420.0,0.0,26420.0,14531.0,11889.0,01/01/2019,Janeiro,2019
1,Governo,Alemanha,Produto 1,1513.0,350,529550.0,0.0,529550.0,432718.0,96832.0,01/12/2019,Dezembro,2019
2,Governo,Alemanha,Produto 2,2146.0,7,15022.0,0.0,15022.0,10730.0,4292.0,01/09/2019,Setembro,2019
3,Governo,Alemanha,Produto 3,1006.0,350,352100.0,0.0,352100.0,261560.0,90540.0,01/06/2019,Junho,2019
4,Governo,Alemanha,Produto 3,1513.0,350,529550.0,0.0,529550.0,393380.0,136170.0,01/12/2019,Dezembro,2019

In [18]:
colunas = ['segmento', 'pais', 'produto', 'qtd.', 'preco_unitario', 'valor_total', 'desconto', 'valor_total_desconto', 'custo_total', 'lucro', 'data', 'mes', 'ano']

In [9]:
# Verificação para ver se o numero da lista "colunas" é igual ao numero de colunas do Data Frame
len(colunas)

13

In [20]:
df.columns = colunas

In [21]:
df.head()

,segmento,pais,produto,qtd.,preco_unitario,valor_total,desconto,valor_total_desconto,custo_total,lucro,data,mes,ano
0,Governo,Alemanha,Produto 1,1321.0,20,26420.0,0.0,26420.0,14531.0,11889.0,01/01/2019,Janeiro,2019
1,Governo,Alemanha,Produto 1,1513.0,350,529550.0,0.0,529550.0,432718.0,96832.0,01/12/2019,Dezembro,2019
2,Governo,Alemanha,Produto 2,2146.0,7,15022.0,0.0,15022.0,10730.0,4292.0,01/09/2019,Setembro,2019
3,Governo,Alemanha,Produto 3,1006.0,350,352100.0,0.0,352100.0,261560.0,90540.0,01/06/2019,Junho,2019
4,Governo,Alemanha,Produto 3,1513.0,350,529550.0,0.0,529550.0,393380.0,136170.0,01/12/2019,Dezembro,2019

## Contagem Registro

In [12]:
df.segmento.value_counts()

segmento
Governo              300
Grandes empresas     100
Médias empresas      100
Pequenas empresas    100
Vendas online        100
Name: count, dtype: int64

In [13]:
df.produto.value_counts()

produto
Produto 3    202
Produto 4    109
Produto 5    109
Produto 6     94
Produto 2     93
Produto 1     93
Name: count, dtype: int64

## Analises Monetárias

In [23]:
df.describe().round(2)

,qtd.,preco_unitario,valor_total,desconto,valor_total_desconto,custo_total,lucro,ano
count,700.00,700.00,700.00,700.00,700.00,700.00,700.00,700.00
mean,1608.29,118.43,182759.43,13150.35,169609.07,147187.85,22421.22,2018.75
std,867.43,136.78,254262.28,22962.93,236726.35,205930.04,42282.73,0.43
min,200.00,7.00,1799.00,0.00,1655.08,918.00,-71250.25,2018.00
25%,905.00,12.00,17391.75,800.32,15928.00,7538.00,2701.80,2018.75
50%,1542.50,20.00,37980.00,2585.25,35540.20,22580.00,8936.40,2019.00
75%,2229.12,300.00,279025.00,15956.34,261077.50,248422.50,21155.74,2019.00
max,4492.50,350.00,1207500.00,149677.50,1159200.00,950625.00,262200.00,2019.00

## Analise de Margem de Lucro

In [24]:
df.head()

,segmento,pais,produto,qtd.,preco_unitario,valor_total,desconto,valor_total_desconto,custo_total,lucro,data,mes,ano
0,Governo,Alemanha,Produto 1,1321.0,20,26420.0,0.0,26420.0,14531.0,11889.0,01/01/2019,Janeiro,2019
1,Governo,Alemanha,Produto 1,1513.0,350,529550.0,0.0,529550.0,432718.0,96832.0,01/12/2019,Dezembro,2019
2,Governo,Alemanha,Produto 2,2146.0,7,15022.0,0.0,15022.0,10730.0,4292.0,01/09/2019,Setembro,2019
3,Governo,Alemanha,Produto 3,1006.0,350,352100.0,0.0,352100.0,261560.0,90540.0,01/06/2019,Junho,2019
4,Governo,Alemanha,Produto 3,1513.0,350,529550.0,0.0,529550.0,393380.0,136170.0,01/12/2019,Dezembro,2019

### Agrupando Dados

In [25]:
colunas = ['desconto', 'valor_total_desconto', 'custo_total', 'lucro']

#### Por Segmento

In [41]:
df_segmento = df.groupby('segmento')[colunas].sum().round(2)
df_segmento["margem_lucro"] = round((df_segmento['lucro'] / df_segmento['valor_total_desconto']) * 100,2)
df_segmento

,desconto,valor_total_desconto,custo_total,lucro,margem_lucro
segmento,,,,,
Governo,3898805.83,52504260.67,41584282.5,10919978.17,20.80
Grandes empresas,1457305.62,19611694.38,20568882.0,-957187.63,-4.88
Médias empresas,200786.92,2381883.08,1746100.0,635783.07,26.69
Pequenas empresas,3513781.50,42427918.50,38641000.0,3786918.50,8.93
Vendas online,134568.36,1800593.64,491233.8,1309359.84,72.72

#### Por Produto

In [39]:
df_produto = df.groupby('produto')[colunas].sum().round(2)
df_produto["margem_lucro"] = round((df_produto['lucro'] / df_produto['valor_total_desconto']) * 100,2)
df_produto

,desconto,valor_total_desconto,custo_total,lucro,margem_lucro
produto,,,,,
Produto 1,1122212.62,13815307.88,13187353.3,627954.58,4.55
Produto 2,1159032.62,15390801.88,13276047.0,2114754.88,13.74
Produto 3,2600518.05,33011143.95,28213706.0,4797437.95,14.53
Produto 4,1576709.04,18250059.46,15944067.0,2305992.46,12.64
Produto 5,1456612.48,20511921.02,17477313.0,3034608.02,14.79
Produto 6,1290163.44,17747116.06,14933012.0,2814104.06,15.86

#### Por País

In [40]:
df_pais = df.groupby('pais')[colunas].sum().round(2)
df_pais["margem_lucro"] = round((df_pais['lucro'] / df_pais['valor_total_desconto']) * 100,2)
df_pais

,desconto,valor_total_desconto,custo_total,lucro,margem_lucro
pais,,,,,
Alemanha,1416126.68,23505340.82,20094218.6,3411122.22,14.51
Canadá,2044508.62,24887654.88,21575835.9,3311818.98,13.31
Chile,1777582.89,20949352.11,18290422.3,2658929.81,12.69
EUA,2239527.84,25029830.16,22194424.3,2835405.86,11.33
França,1727502.22,24354172.28,20876597.2,3477575.08,14.28